In [1]:
import pandas as pd
import numpy as np

d = pd.DataFrame([[1, 2, 3, 4], [5, 6, 7, 8]], columns=['co1', 'co2', 'co3', 'co4'])
d

   co1  co2  co3  co4
0    1    2    3    4
1    5    6    7    8

In [2]:
dd = pd.DataFrame({'co1': [1, 5], 'co2': [2, 6], 'co3': [3, 7], 'co4': [4, 8]})
dd

   co1  co2  co3  co4
0    1    2    3    4
1    5    6    7    8

In [3]:
dd.values

array([[1, 2, 3, 4],
       [5, 6, 7, 8]], dtype=int64)

In [4]:
dd.index = list(range(1, 3))
dd

   co1  co2  co3  co4
1    1    2    3    4
2    5    6    7    8

In [5]:
dd['co2']

1    2
2    6
Name: co2, dtype: int64

In [6]:
dd[['co2', 'co3']]

   co2  co3
1    2    3
2    6    7

In [7]:
dd.co1

1    1
2    5
Name: co1, dtype: int64

In [8]:
dd.iloc[0]
dd.iloc[0:1]

   co1  co2  co3  co4
1    1    2    3    4

In [9]:
dd['co5'] = [10, 11]
dd

   co1  co2  co3  co4  co5
1    1    2    3    4   10
2    5    6    7    8   11

In [10]:
del dd['co2']
dd

   co1  co3  co4  co5
1    1    3    4   10
2    5    7    8   11

In [11]:
dd.apply(lambda x : x + 2)

   co1  co3  co4  co5
1    3    5    6   12
2    7    9   10   13

In [12]:
dd.apply(sum)

co1     6
co3    10
co4    12
co5    21
dtype: int64

In [13]:
dd.apply(sum, axis=1)

1    18
2    31
dtype: int64

In [14]:
dd.apply(lambda x : x[1] + x[2])

co1     6
co3    10
co4    12
co5    21
dtype: int64

In [15]:
dd.apply(lambda x : x[0] + x[1] + x[2] + x[3], axis=1)

1    18
2    31
dtype: int64

In [24]:
a = pd.DataFrame([[1, None, 3, None], [5, 9, 7, 8], [1, 3, 5, None]], columns=['k', 'c', 'p', 'l'])
a.isnull()

       k      c      p      l
0  False   True  False   True
1  False  False  False  False
2  False  False  False   True

In [25]:
a.dropna()

   k    c  p    l
1  5  9.0  7  8.0

In [28]:
a.fillna(99)

   k     c  p     l
0  1  99.0  3  99.0
1  5   9.0  7   8.0
2  1   3.0  5  99.0

In [32]:
a = pd.DataFrame([[1, None, 3, '4'], [5, 9, 7, None], [1, 3, 5, np.nan]], columns=['k', 'c', 'p', 'l'])
a.isnull()
a

   k    c  p     l
0  1  NaN  3     4
1  5  9.0  7  None
2  1  3.0  5   NaN

In [39]:
# a = pd.DataFrame([['g', 50], ['g', 30], ['d', 20], ['d', 70]], columns=['class', 'score'], index=['A', 'B', 'C', 'D'])
a = pd.DataFrame({'class':['g', 'g', 'd','d'], 'score':[50, 30, 20, 70]}, columns=['class', 'score'], index=['A', 'B', 'C', 'D'])
a

  class  score
A     g     50
B     g     30
C     d     20
D     d     70

In [40]:
a.groupby('class').mean()

       score
class
d       45.0
g       40.0

In [52]:
a.groupby('class').agg(lambda x : print( x[0] , x[1]) )

20 70
50 30

      score
class
d      None
g      None